    PANDAS
================

Used to handel large datasets

insatllation : pip install pandas

In [8]:
import pandas as pd
import numpy as np

In [12]:
info={"name":"karthik","role":"intern","place":"Ernakulam"}

out=pd.Series(info)
print(out)

name       karthik
role        intern
place    Ernakulam
dtype: object

In [10]:
data={"Name":["amal","arun","sanjay"],
      "Role":["Hr","Dev","Testing"],
      "Place":["kochi","chennai","tvm"],
      "salary":["10000","20000","30000"]}

result=pd.DataFrame(data)
result

     Name     Role    Place salary
0    amal       Hr    kochi  10000
1    arun      Dev  chennai  20000
2  sanjay  Testing      tvm  30000